#დავალება 1

points = 50

points = 60

points = 70

print(points)

#დავალება 2

age = 156
print(age)

#დავალება 3

(5) ("და") (6)

print(5+6)

print(6-5)

print(5*6)

print(6/5)

#დავალება 4

#7surname===dsjvbsd

#print(7surname")

surname = "ebralidze"

print("surname")

#დავალება 5

# 1. ცვლადის შექმნა მისი დაა-update-ება და მისი დეკლარირება

# 2. კოდის გასწორება

# 3. ორი integer ტიპის ცვლადის დაწერა და მათი ჯამი-ს სხვაობი-ს ნამრავლი-ს და განაყოფის დეკლარირება

# 4. არასწორი კოდის მოფიქრება და სწორი ვერსიის დეკლარირება






