# 1) ჩამოთვალეთ ყველა დღეს ნასწავლი error'ის ტიპი და ახსენით რა რა შემთხვევაში გამოდის

# ValueError- არის ერორი როდესაც მნიშვნელობაში გვაქ შეცდომა მაგალითად როდესაც შვენ მოვითხოვთ რიცხვს და რიცხვის მაგივრად მივუთეთებთ ასოს
# IndexError- არის ერორი როდესაც ინდექსები არის შეცდომით დაწერილი მაგალითად ინდეხ როდესაც აღემატება იმ რაოდენობას რომელიც ლისტში არის მოცემული
# NameError- არის ერორი როდესაც სხვა რაღაც გვაქ მოცემული და სხვა რაღაცას ვითხოვთ
# Syntaxerror- არის ერორი როდესაც კოდის წერის დროს კოდს რაღაცა წვრილმანს მაინც მოაკლებ და არ დაუწერ 
# Typeerror- არის ერორი როდესაც კოდის დაწერისას არგუმენტს არასწორი სახით ვწერთ


# 2) დაწერეთ ისეთი კოდი სადაც იქნება NameError და გაუმკლავდით try/except'ით

name = "Anna"

try:
    print("your name is succsessfull")
except NameError:
    print("There was name error")

# 3) დაწერეთ ისეთი კოდი სადაც იქნება IndexError და გაუმკლავდით try/except'ით

listn = [1, 2, 3, 4, 5, 6]



# 4) დაწერეთ ისეთი კოდი სადაც იქნება ValueError და გაუმკლავდით try/except'ით



# 5) კომენტარებით ახსენით რაში გვადგება try/except