// 2) მოიძიეთ ინფორმაცია Document Object Model'ზე და ახსენით რა არის

// DOM არის მეთოდი HTML/XML დოკუმენტების მართვისთვის JavaScript-ით.

// 3) შექმენით 2 Number ტიპის ცვლადი, დაამატეთ ერთმანეტს და გამოიტანეთ console'ში

let num1 = 5;
let num2 = 10;
let sum = num1 + num2;
console.log(sum);

// 4) ახსენით რა არის console

// Console არის ინსტრუმენტი, რომელიც გამოიყენება JavaScript-ის კონსოლური შეტყობინებების გამოსატანად, როგორიცაა შეცდომები ან სხვა ინფორმაცია.

// 5) ახსენით რას აკეთებს let keyword

// let იძლევა ცვლადის შექმნის საშუალებას, რომელიც აქვს ბლოკის მასშტაბით მოქმედება.