#დავალება 1

#str არის წიანდადება ანდ რიცხვი ან თუმდაც ასო რომელსაც გარედან შემოსაზღვრავს ბრწყალები მაგალითად: "andria"; "ebralidze".
#int არის ნებისმიერი მთელი რიცხვიი რომელიც არის ან უარყოფით ან დადებით ან ნული მაგალითად: 5;10;15 და ასე შემდეგ
#float არის რიცხვი რომელსაც გააჩნია მთელი მაგალითად: 5.5;10.5;7.9 და ასე შემდეგ
#boolean არის True ან False

#დავალება 2

#კონკატენაცია არის 2 სტრინგის შეერთება

#დავალება 3

#ეს ჩვენ იმიტომ არ შეგვიძლია რომ ბრჭყალებში მყოფი რიცხვები ერთდება და არ ემატება ხოლო int ტიპის რიცხვებს შეუძლიათ მიმატებადა სწორი ტოლობის მიღება

#დავალება 4

#ამის შემოწმება შესაძლებელია ეს: print(type(int(5)))

#დავალება 5

#explicit conversion - როდესაც ხელით ვცვლით მონაცემთა ტიპს; მაგალითად ამ ფუნქციებით: int(), str(), float()...
#implicit conversion - როდესაც ავტომატურად იცვლება მონაცემთა ტიპი; მაგალითად როდესც ორ ინტეჯერს გავყოფთ ერთმანეთზე ყოველთვის მივიღებთ float-ს

#დავალება 6

# ჩვენ ვიცით <;>;=. ნიშნები იმსთვის რომ შევადაროთ