# 2) ჩამოწერეთ რომელი data type'ბი იცით და ახსენით რა რას ემსახურება

# integer- არის ნებისმიერი მთელი რიცხვიი რომელიც არის ან უარყოფით ან დადებით ან ნული მაგალითად: 5;10;15 და ასე შემდეგ
# string- არის წიანდადება ანდ რიცხვი ან თუმდაც ასო რომელსაც გარედან შემოსაზღვრავს ბრწყალები მაგალითად: "andria"; "ebralidze".
# float- არის რიცხვი რომელსაც გააჩნია მთელი მაგალითად: 5.5;10.5;7.9 და ასე შემდეგ
# boolen- არის True ან False

# 3) თქვენი სიტყვებით ახსენით რაში გვჭირდება მონაცემთა ტიპის შეცვლა, მაგალითად string'ის integer'ად გადაქცევა

#ეს ჩვენ იმაში გვჭირდება რომ სწორი ტოლობები შევქმნათ და რიცხვები სწორად გავამრავლოთ;გავყოთ;მივუმატოთ და გამოვაკლოთ ერთმანეთს 