# str - string
# int - integer
# float
# boolean

# string'ი არის ნებისმიერი სიმბოლოების ერთობლიობა რომელსაც გარშემო აქვს ბრჭყაკები
# მაგალითად:
# "abcd"
# "12345"
# "./,p;123[]"
# 'abcd'
# "Hello world, today is good day"

# integer'ი  ქართულად მიშნავს მთელ რიცხვს
# მაგალითდ:
# 1
# 200
# 2000000
# 10
# 12
# 13

# float'ი ქართულად ნიშნავს წილად რიცხვს 
# მაგალითად
# 1.2
# 10.8
# 13.5
# 47.0

# boolean'ი არის მონაცემთა ტიპი, რომელსაც აქვს მხოლოდ 2 შესაძლო მნიშვნელობა
# ესენი არის: True ან False (მართლია ან ტყუილია)

# True - 1
# False -0