#1) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ამ ცვლადის მნიშვნელობა, რამოდენიმეჯერ. საბოლოოდ კი დაპრინტეთ ეს ცვლადი

points = 50
points = points + 30
print(points)

#2) გაასწორეთ შემდეგი კოდი:
#     1age == 156     
#     print(("1age)     


age = 156
print(age)

#3) დაწერეთ პროგრამა, რომელიც შეიცავს ორ integer ტიპის ცვლადს (მაგალითად, a და b), შემდეგ გამოიანგარიშეთ ამ ცვლადების ჯამი, სხვაობა, ნამრავლი და განაყოფი. 


(5) ("და") (6)

print(5+6)

print(6-5)

print(5*6)

print(6/5)

#4) დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.

#7surname===dsjvbsd

#print(7surname")

surname = "ebralidze"

print("surname")

#5) ახსენით ოთხივე დავალება კომენტარებით 

# 1. ცვლადის შექმნა მისი დაა-update-ება და მისი დეკლარირება

# 2. კოდის გასწორება

# 3. ორი integer ტიპის ცვლადის დაწერა და მათი ჯამი-ს სხვაობი-ს ნამრავლი-ს და განაყოფის დეკლარირება

# 4. არასწორი კოდის მოფიქრება და სწორი ვერსიის დეკლარირება